numbers = [2, -93, -2, 8, None, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]

# TODO заменить значение пропущенного элемента средним арифметическим

index = numbers.index(None)                        # Индекс пустого значения
sum_ = sum(numbers[:index] + numbers[(index+1):])  # Сумма значений листа (без учёта пропуска)
count_ = len(numbers)                              # Количество значений
numbers[index] = sum_/count_                       # Замена на ср. арифметическое значение

print("Измененный список:", numbers)
